controllers/PostController.php

SELECT * FROM `post` WHERE `id`='10'
---
    protected function findModel($id)
    {
        if (($model = PostModel::findOne($id)) !== null) {